# Ultralytics YOLO 🚀, AGPL-3.0 license
# 融合第一次backbone与第二次head的改进模型
nc: 6  # 类别数量保持一致
scales:
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# 第一次改进的backbone（保留原特征尺寸输出）
backbone:
  - [-1, 1, Conv, [64, 6, 2, 2]]  # 0-P1/2 (64, H/2, W/2)
  - [-1, 1, Conv, [128, 3, 2]]    # 1-P2/4 (128, H/4, W/4)
  - [-1, 6, C2f_Faster, [128, True]]  # 2 (128, H/4, W/4)
  - [-1, 1, FEM, [128]]           # 3-P3/8 (128, H/8, W/8) 关键输出：供head层P3融合
  - [-1, 1, Conv, [256, 3, 2]]    # 4-P4/16 (256, H/16, W/16)
  - [-1, 6, C2f_Faster, [256, True]]  # 5 (256, H/16, W/16)
  - [-1, 1, FEM, [256]]           # 6-P4/16 (256, H/16, W/16) 关键输出：供head层P4融合
  - [-1, 1, Conv, [512, 3, 2]]    # 7-P5/32 (512, H/32, W/32)
  - [-1, 9, C2f_Faster, [512, True]]  # 8 (512, H/32, W/32)
  - [-1, 1, SPPF, [512, 5]]       # 9 (512, H/32, W/32) 关键输出：供head层P5融合

# 第二次改进的head（适配第一次backbone的特征尺寸）
head:
  # P5分支（基于backbone的1/32特征图）
  - [-1, 1, CA, []]               # 10 (512, H/32, W/32)  CA作用于SPPF输出
  - [-1, 1, nn.Conv2d, [256, 1]]  # 11 (256, H/32, W/32) 降维匹配第二次head通道数
  - [-1, 3, C2f, [256]]           # 12 P5 (256, H/32, W/32)

  # P4分支（融合backbone的1/16特征图与P5上采样特征）
  - [6, 1, CA, []]                # 13 (256, H/16, W/16)  CA作用于backbone的P4输出（层6）
  - [-1, 1, nn.Conv2d, [256, 1]]  # 14 (256, H/16, W/16) 保持通道一致
  - [11, 1, nn.ConvTranspose2d, [256, 3, 2, 1, 1]]  # 15 (256, H/16, W/16) 上采样P5特征至1/16
  - [-1, 1, CA, [4, False]]       # 16 (256, H/16, W/16)
  - [[-1, 14], 1, multiply, []]   # 17 (256, H/16, W/16) 注意力加权融合
  - [[-1, 15], 1, Add, []]        # 18 (256, H/16, W/16) 残差连接
  - [-1, 3, C2f, [256]]           # 19 P4 (256, H/16, W/16)

  # P3分支（融合backbone的1/8特征图与P4上采样特征）
  - [3, 1, CA, []]                # 20 (128, H/8, W/8)  CA作用于backbone的P3输出（层3）
  - [-1, 1, nn.Conv2d, [256, 1]]  # 21 (256, H/8, W/8) 升维至256通道（匹配后续特征）
  - [15, 1, nn.ConvTranspose2d, [256, 3, 2, 1, 1]]  # 22 (256, H/8, W/8) 上采样P4特征至1/8
  - [-1, 1, CA, [4, False]]       # 23 (256, H/8, W/8)
  - [[-1, 21], 1, multiply, []]   # 24 (256, H/8, W/8) 注意力加权融合
  - [[-1, 22], 1, Add, []]        # 25 (256, H/8, W/8) 残差连接
  - [-1, 3, C2f, [256]]           # 26 P3 (256, H/8, W/8)

  # 检测头（确保输出尺寸比例1:2:4）
  - [[26, 19, 12], 1, Detect, [nc]]  # Detect(P3/8, P4/16, P5/32)